{
    "courseOrientation": "This course works best when you treat it like a short daily work sprint. Each day follows the same rhythm: read a little, do the work, submit what you produced, then stop. Do not keep going to make it perfect. The point is momentum and evidence, not polish.\n\nYou will often act before you feel fully ready. That is intentional. Readiness usually shows up after you start, not before. In this course, decisions are small and reversible. You are not marrying an idea. You are moving it from foggy to concrete fast enough to learn what is real.\n\nUse the workbook as a decision log, not a diary. A diary records feelings. A decision log records choices, assumptions, numbers, and next actions. When you look back later, you should be able to answer: What did I decide, and why? What did I assume? What evidence did I collect? What will I do next?\n\nProgress is simple. Every DO checkbox represents a real output you created. When you check it, you should have something you can paste, link, or show: a sentence, a list, a price guess, a mini plan, a cost estimate. No checkboxes for motivation, confidence, or understanding. If it did not produce an artifact, it does not count.\n\nTime expectations: plan for 25 to 45 minutes per day. Most days are three short work blocks. If you only have 25 minutes, do the first two DO blocks and finish the third later the same day. If you have 45 minutes, keep the pace calm and write clearly. Your job is to produce usable drafts that can be improved later.",
    "weeks": {
        "1": {
            "name": "Week 1 - Build an Arsenal of Ideas",
            "introduction": "This week is about volume and structure. You will generate ideas on purpose, then shape them into a form you can compare. The goal is not to find the one perfect idea. The goal is to build an arsenal and learn to judge ideas quickly.\n\nBy the end of this week, you will have:\n- A clear 27-day target and constraints that guide your choices\n- Three to five well-described side hustle ideas with basic scores and notes\n- A simple profit forecast for your best candidates, with assumptions written down\n\nHow to pace it:\n- Do one day per calendar day if you can, but do not rush the writing\n- Keep every output short and specific. One paragraph beats one page\n- Save everything in one place so you can reuse it next week\n\nCommon trap to avoid: Many people try to think their way into certainty. They research endlessly, or they try to design the perfect business before they have even chosen a customer and a price. This week, you will do the opposite: create small, testable definitions and numbers, then use them to narrow down."
        }
    }
}