[
    {
        "day": 1,
        "title": "Predict the Future",
        "week": 1,
        "goal": "Identify 3 to 5 opportunity directions by looking at where the world is heading",
        "timeEstimate": "35-45 min",
        "hook": "The best side hustles solve tomorrow's problems. Today you learn to see what others miss.",
        "lesson": {
            "title": "Why Today Matters",
            "content": "Most people start with themselves. What am I good at? What do I like? Those questions matter, but they come later. Today you start with the world.\n\nThe side hustles that grow fastest are the ones that ride a wave. They meet a need that is getting bigger, not smaller. They help people with problems that are becoming more common, not less. If you pick the right wave, everything else gets easier. Marketing is easier because people are already looking for help. Sales are easier because the pain is fresh. Growth is easier because the trend is on your side.\n\nSo before you brainstorm business ideas, you are going to brainstorm changes. What is shifting in the world around you? What do you notice that most people ignore? What problems are getting worse? What new behaviors are spreading?\n\nYou do not need to be a futurist. You just need to pay attention. Think about the past two or three years. What surprised you? What frustrated you? What did you start doing that you did not do before? What did your friends or coworkers start doing? These observations are raw material.\n\nToday is not about choosing one idea. It is about opening your eyes. You will end the day with 3 to 5 opportunity directions, not a final decision. That comes later. Right now, the goal is to see more clearly where the world is going, so you can position yourself to help."
        },
        "practice": {
            "title": "The Five Year Snapshot (3-5 minutes)",
            "content": "Close your eyes for 30 seconds. Take a few slow breaths.\n\nNow imagine yourself five years from now. You are reading the news, scrolling your phone, or talking to a friend. What are people worried about? What new technologies are they using? What jobs have changed? What new problems have appeared?\n\nOpen your eyes. Grab a piece of paper or open a notes app. Set a timer for 3 minutes. Write down everything you imagined, even if it feels obvious or strange. Do not edit yourself. Just write.\n\nWhen the timer ends, circle the two or three observations that feel most real to you. These are your starting points for today."
        },
        "mission": [
            {
                "task": "Complete the Five Year Snapshot practice",
                "time": "5 min"
            },
            {
                "task": "List 5 changes or trends you have noticed in the past 1 to 3 years",
                "time": "10 min"
            },
            {
                "task": "For each trend, write where you think it leads in the next 2 to 5 years",
                "time": "10 min"
            },
            {
                "task": "Identify who will struggle most because of these changes",
                "time": "5 min"
            },
            {
                "task": "List what kind of help those people might pay for",
                "time": "5 min"
            },
            {
                "task": "Write down 3 to 5 opportunity directions that interest you",
                "time": "5 min"
            },
            {
                "task": "Note any personal skills or interests that connect to these directions",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Trying to predict the exact future. You are not writing a research report. You are noticing patterns. Rough is fine.\n\nOnly thinking about technology. Trends also happen in behavior, culture, work, health, relationships, and money. Look wider.\n\nCensoring yourself. If an observation feels too obvious or too weird, write it down anyway. Obvious often means overlooked.\n\nLooking for the one perfect trend. You are generating options. Aim for 5 trends, not 1.\n\nForgetting your own life. The best observations often come from problems you have personally noticed or experienced.",
        "doneMeans": "You have at least 5 trends documented with predictions, and 3 to 5 opportunity directions written down with notes on who needs help.",
        "reviewCTA": "Want feedback on your opportunity directions? Submit your Day 1 workbook for review and get suggestions within 48 hours."
    },
    {
        "day": 2,
        "title": "Learn How Money Grows on Trees",
        "week": 1,
        "goal": "Discover your hidden assets and generate 10 to 20 idea seeds from them",
        "timeEstimate": "35-45 min",
        "hook": "You already have more than you think. Today you inventory your unfair advantages and turn them into hustle ideas.",
        "lesson": {
            "title": "Why Today Matters",
            "content": "Almost everyone underestimates what they already have. When asked what assets they bring to a side hustle, most people shrug and say nothing special. But that is almost never true.\n\nYou have skills, even if they feel ordinary to you. You have access to communities, tools, or information that others lack. You have experiences that taught you things. You have connections. You have routines and habits that could be valuable. These are your money trees. They are sources of value that already exist in your life.\n\nToday you will inventory those trees. Then you will shake them to see what falls out.\n\nThink about what people already ask you for help with. Think about what you know how to do that others find confusing. Think about where you spend your time and what insider knowledge that gives you. Think about what tools or equipment you already own. Think about what communities you belong to and what access that creates.\n\nNone of these assets are business ideas on their own. But combined with the opportunity directions from yesterday, they become seeds. Each seed is a possible side hustle waiting to be tested.\n\nBy the end of today, you will have a list of 10 to 20 idea seeds. Not polished ideas. Not business plans. Just seeds. Some will grow. Some will not. But you need volume before you can choose."
        },
        "practice": {
            "title": "The Asset Inventory (4-6 minutes)",
            "content": "Set a timer for 5 minutes. You are going to write as fast as you can without stopping.\n\nDivide your paper or screen into four sections:\n\n1. Skills: Things you know how to do. Include obvious ones. Include weird ones. Include things you do at work and things you do at home.\n\n2. Access: Communities, groups, workplaces, forums, or networks you belong to. Languages you speak. Locations you know well.\n\n3. Tools: Equipment, software, spaces, or resources you already own or have access to.\n\n4. Wins: Times people thanked you, asked for your help, or paid you for something. Compliments you have received.\n\nWrite until the timer ends. Do not stop to judge or rank. Just list everything you can think of."
        },
        "mission": [
            {
                "task": "Complete the Asset Inventory practice",
                "time": "6 min"
            },
            {
                "task": "Review your list and circle the 5 to 8 strongest assets",
                "time": "5 min"
            },
            {
                "task": "For each circled asset, write why it could be valuable to someone",
                "time": "10 min"
            },
            {
                "task": "Pick your top 3 to 5 money trees and name them",
                "time": "5 min"
            },
            {
                "task": "For each money tree, generate 2 to 4 hustle idea seeds",
                "time": "10 min"
            },
            {
                "task": "Cross-reference with your Day 1 opportunity directions",
                "time": "5 min"
            },
            {
                "task": "Star any idea seeds that connect to a trend and an asset",
                "time": "3 min"
            }
        ],
        "commonMistakes": "Saying you have nothing special. Everyone has assets. You just need to look.\n\nOnly listing professional skills. Hobbies, life experiences, and random knowledge count too.\n\nSkipping the wins section. What people already asked you for is the strongest signal of value.\n\nNot generating enough seeds. Aim for 10 to 20. Quantity now, quality later.\n\nJudging ideas while generating them. Save judgment for Day 4. Right now just list.",
        "doneMeans": "You have an inventory of your assets, 3 to 5 named money trees, and 10 to 20 idea seeds generated from them.",
        "reviewCTA": "Want help identifying your strongest money trees? Submit your Day 2 workbook for personalized feedback."
    },
    {
        "day": 3,
        "title": "Brainstorm, Borrow, or Steal Ideas",
        "week": 1,
        "goal": "Generate at least 15 candidate ideas and narrow to a shortlist of 3",
        "timeEstimate": "40-50 min",
        "hook": "Forget originality. The best ideas are borrowed, mixed, and adapted. Today you fill the pipeline.",
        "lesson": {
            "title": "Why Today Matters",
            "content": "Most people get stuck looking for the perfect idea. They want something completely original. They want it to feel right immediately. They want to be sure before they start.\n\nThat is backwards. The way to find good ideas is to generate many ideas first, then filter. You cannot evaluate options you have not created. So today is about volume.\n\nYou will use three methods:\n\nBrainstorm. Start with problems, frustrations, and requests you have noticed. What annoys people? What takes too long? What is confusing? What do people complain about? What do they wish existed? Turn each problem into a possible solution you could offer.\n\nBorrow. Look at what is already working. Find successful side hustles in other industries, other cities, or other audiences. Ask yourself: could I adapt this model for a different group? Could I do this locally? Could I do this for a niche I understand?\n\nSteal. This is ethical imitation. Find a proven offer structure and replicate it with your own spin. You are not copying the work. You are copying the format. Then you differentiate with your unique voice, audience, or angle.\n\nDo not filter while you generate. That kills momentum. Write down every idea, even the bad ones. You will evaluate later."
        },
        "practice": {
            "title": "The Idea Sprint (5-7 minutes)",
            "content": "Set a timer for 6 minutes. You are going to generate ideas without stopping.\n\nStart with brainstorm mode (2 minutes). Write every problem, frustration, or request you can think of. Turn each one into a possible side hustle. Write fast.\n\nSwitch to borrow mode (2 minutes). Think of side hustles you have seen succeed. Write down how you could adapt each one for a different audience or market.\n\nSwitch to steal mode (2 minutes). Think of offer formats that work. Courses. Consulting. Templates. Rental. Subscription. Write down how you could apply each format to something you know.\n\nWhen the timer ends, count your ideas. If you have fewer than 12, set another 3 minute timer and keep going."
        },
        "mission": [
            {
                "task": "Complete the Idea Sprint practice",
                "time": "7 min"
            },
            {
                "task": "Review and expand your brainstorm list to at least 8 ideas",
                "time": "5 min"
            },
            {
                "task": "Find 3 successful side hustles online and write how you could borrow them",
                "time": "10 min"
            },
            {
                "task": "Identify 3 proven offer formats and write how you could steal ethically",
                "time": "8 min"
            },
            {
                "task": "Combine random ideas from your list to create 2 to 3 mashups",
                "time": "5 min"
            },
            {
                "task": "Count your total ideas, aim for at least 15",
                "time": "2 min"
            },
            {
                "task": "Use gut feeling to shortlist your top 3 ideas",
                "time": "5 min"
            },
            {
                "task": "Write 2 sentences on why each shortlisted idea might work",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Judging while generating. Save evaluation for tomorrow. Today is about quantity.\n\nWaiting for inspiration. Inspiration comes from motion. Start writing and ideas will follow.\n\nThinking borrowed ideas are cheating. Every business is built on existing models. Adaptation is innovation.\n\nStopping at 5 or 10 ideas. Push past the obvious. The best ideas often come after the first wave.\n\nChoosing a final idea today. You are shortlisting, not deciding. The real evaluation happens on Day 4.",
        "doneMeans": "You have at least 15 documented ideas using all three methods, and a shortlist of 3 favorites with brief notes on why each could work.",
        "reviewCTA": "Want a second opinion on your shortlist? Submit your Day 3 workbook for feedback on which ideas have the most potential."
    },
    {
        "day": 4,
        "title": "Weigh the Obstacles and Opportunities",
        "week": 1,
        "goal": "Evaluate your shortlist and choose 1 or 2 ideas to test with numbers tomorrow",
        "timeEstimate": "40-50 min",
        "hook": "Every idea has trade-offs. Today you see them clearly so you can choose wisely.",
        "lesson": {
            "title": "Why Today Matters",
            "content": "You have a shortlist of 3 ideas. They all seem interesting. But they are not equal. Some will be easier to start. Some will be faster to validate. Some will have more upside. Some will have hidden obstacles that trip you up later.\n\nToday you evaluate. You look at each idea honestly and ask two questions: What could go wrong? What could go right?\n\nObstacles include: time required to start, upfront money needed, skills you lack, dependence on other people, legal or platform risks, and complexity. The more obstacles, the harder the path.\n\nOpportunities include: speed to first sale, clarity of the customer pain, potential for repeat buyers, pricing power, low delivery time, and room to grow. The more opportunities, the better the potential.\n\nYou will score each idea on both sides. Then you will compare. The goal is not to find a perfect idea. There is no such thing. The goal is to find the idea with the best balance given your situation.\n\nBy the end of today, you will have a clear winner or a clear top two. Tomorrow you will run the numbers on that winner to see if the math makes sense."
        },
        "practice": {
            "title": "The Decision Clarity Check (2-4 minutes)",
            "content": "Before you start scoring, take a moment to clear your head.\n\nSit quietly for 30 seconds. Notice any attachment you have to a particular idea. Notice any resistance to ideas that feel harder. These biases are normal, but you want to see them so they do not control you.\n\nNow ask yourself:\n\n1. If I had to start one of these ideas tomorrow with no more research, which would I pick? Write it down.\n\n2. If I had to drop one idea right now, which would go? Write it down.\n\n3. What am I afraid of with each idea? Write one fear per idea.\n\nThese answers are data. They reveal your intuition. Now you will check that intuition against a structured evaluation."
        },
        "mission": [
            {
                "task": "Complete the Decision Clarity Check",
                "time": "4 min"
            },
            {
                "task": "Write a one sentence description for each of your 3 shortlisted ideas",
                "time": "5 min"
            },
            {
                "task": "For each idea, estimate startup time, startup cost, and skill gap",
                "time": "10 min"
            },
            {
                "task": "For each idea, rate complexity, speed to first sale, and repeat potential",
                "time": "10 min"
            },
            {
                "task": "Score each idea: opportunity rating 1 to 10, obstacle rating 1 to 10",
                "time": "5 min"
            },
            {
                "task": "Compare scores and choose your top 1 or 2 ideas",
                "time": "5 min"
            },
            {
                "task": "Write why your winner wins and what concerns you most about it",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Letting excitement override analysis. The fun idea is not always the smart idea.\n\nIgnoring obstacles because you want the idea to work. Obstacles do not disappear when you ignore them.\n\nOverweighting obstacles because of fear. Many obstacles are smaller than they feel.\n\nNot being honest about skill gaps. If you lack a critical skill, factor in the time to learn it.\n\nChoosing based on complexity alone. Simple ideas are good, but upside matters too.\n\nTrying to pick a final idea today. You are narrowing to 1 or 2 for tomorrow's numbers test. The final decision comes after you run the math.",
        "doneMeans": "Your 3 ideas are scored on obstacles and opportunities, and you have chosen 1 or 2 winners with written reasoning.",
        "reviewCTA": "Not sure if you are weighing obstacles fairly? Submit your Day 4 workbook for objective feedback on your evaluation."
    },
    {
        "day": 5,
        "title": "Forecast Your Profit on the Back of a Napkin",
        "week": 1,
        "goal": "Do a fast profit forecast to test if your top idea is worth pursuing",
        "timeEstimate": "45-60 min",
        "hook": "Your idea means nothing until the math works. Today, you test viability in 30 minutes with a napkin and basic arithmetic.",
        "lesson": {
            "title": "Why Today Matters",
            "content": "Most people skip this step. They dive into building, branding, and perfecting before they know if the numbers make sense. Then, six months later, they wonder why they are exhausted and broke. You will not be that person.\n\nToday is about protection. You are protecting your future time and energy by doing simple math now. If the numbers look bad, you find out today, not after you have invested hundreds of hours. If the numbers look good, you move forward with confidence instead of hope.\n\nHere is the truth about profit forecasting: it does not need to be precise. You are not submitting a report to investors. You are testing whether an idea is worth your attention. Round numbers are fine. Estimates are expected. The goal is direction, not decimals.\n\nYou will work with three core numbers: what you charge, how many you sell, and what it costs to deliver. Multiply the first two, subtract the third, and you have profit. That is the entire formula. Everything else is detail.\n\nThe hard part is not the math. The hard part is being honest about your assumptions. People consistently overestimate how many sales they will get and underestimate how much time each sale takes. Today, you will build two scenarios: one conservative and one optimistic. The conservative scenario assumes things go slower than you hope. The optimistic scenario assumes your best reasonable case. Reality usually lands somewhere between.\n\nOne more thing: your time has a cost. If you spend 10 hours a week on a side hustle that generates $100 per month, you are earning $2.50 per hour. That might be fine if you love the work and see growth potential. But you should know that number, not discover it accidentally.\n\nBy the end of today, you will have a simple forecast that tells you whether this idea deserves your next three weeks. No guessing. No hoping. Just numbers on paper that either say keep going or try another idea."
        },
        "practice": {
            "title": "The Assumption Check (2-7 minutes)",
            "content": "Before you touch any numbers, take a few minutes to calm the math anxiety and surface your hidden assumptions.\n\nSit quietly for 30 seconds. Notice any tension you feel about money or math. Acknowledge it. This exercise is not a test. There are no wrong answers, only honest ones.\n\nOn a blank piece of paper or in a notes app, complete these sentences without overthinking:\n\n1. I think I could charge $____ for this.\n2. I think I could realistically sell ____ per month.\n3. I think each sale would take me about ____ minutes to deliver.\n4. I think my monthly costs would be around $____.\n\nDo not research. Do not calculate. Just write your gut answers.\n\nNow look at those numbers. Ask yourself: where did these come from? Are they based on research, comparison, or pure imagination? Put a star next to any number that feels more like a guess than an estimate.\n\nThis practice surfaces the assumptions you are about to test. Now you know which numbers need extra scrutiny."
        },
        "mission": [
            {
                "task": "Complete the Assumption Check practice above",
                "time": "3 min"
            },
            {
                "task": "Write down your chosen idea name and what the offer is",
                "time": "5 min"
            },
            {
                "task": "Research 2 to 3 comparable offers and note their prices",
                "time": "10 min"
            },
            {
                "task": "Set three price options: low, middle, high",
                "time": "5 min"
            },
            {
                "task": "Estimate conservative and optimistic monthly sales for each price",
                "time": "10 min"
            },
            {
                "task": "List your direct costs per sale and monthly fixed costs",
                "time": "10 min"
            },
            {
                "task": "Estimate minutes to fulfill one sale",
                "time": "5 min"
            },
            {
                "task": "Calculate monthly revenue, costs, and profit for both scenarios",
                "time": "10 min"
            },
            {
                "task": "Answer: Is this idea worth pursuing? Write your decision.",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Underpricing because of fear. New sellers often set prices too low because they worry no one will pay. Check comparable offers. Your price should be based on value and market, not insecurity.\n\nIgnoring time cost. If you spend 5 hours per sale and charge $50, you are earning $10 per hour before expenses. Factor your time in when judging viability.\n\nUsing optimistic numbers only. Everyone wants to believe the best case. Build a conservative scenario first. If the conservative numbers work, the optimistic ones are a bonus.\n\nForgetting recurring costs. Software subscriptions, transaction fees, and supplies add up. List every monthly cost, even small ones.\n\nSkipping comparable research. You cannot estimate your price in a vacuum. Spend 10 minutes finding similar offers and their price ranges.\n\nTreating the forecast as permanent. This is a snapshot based on current assumptions. It will change as you learn more. The goal is not perfection, just a checkpoint.",
        "doneMeans": "You have calculated profit for both conservative and optimistic scenarios, compared them to your target, and made a clear decision about whether to continue with this idea.",
        "reviewCTA": "Want a second opinion on your numbers? Submit your Day 5 workbook for review and get feedback on your pricing logic and profit assumptions within 48 hours."
    },
    {
        "day": 6,
        "title": "Use the Side Hustle Selector to Compare Ideas",
        "week": 2,
        "goal": "Pick one primary idea and one backup using a five-factor scoring system",
        "timeEstimate": "40-50 min",
        "hook": "Debate ends today. You will score, rank, and commit to one idea for the next phase.",
        "lesson": {
            "title": "Why Today Matters",
            "content": "You have been exploring. Now it is time to decide. Indecision is expensive. Every day you spend debating is a day you are not building, testing, or earning. Today you stop the loop.\n\nThe goal is not to find a perfect idea. Perfect ideas do not exist. The goal is to find a good enough idea that matches your situation and commit to testing it properly. Commitment unlocks energy. Hesitation drains it.\n\nYou will use a five-factor system to rank your ideas:\n\nFeasibility. Can you actually do this with your current skills, time, and resources? An idea you cannot execute is not an idea. It is a fantasy.\n\nProfitability. Does the math work? Can you sell this at a price that leaves meaningful profit after costs and your time?\n\nPersuasion. Is there a clear reason to buy now? Does this solve a problem that feels urgent or painful? Can you explain it in one sentence?\n\nEfficiency. How fast can you launch and test? Ideas that require months of prep before you can get feedback are dangerous for part-time hustlers.\n\nMotivation. How excited are you? You will need to push through hard moments. If you feel nothing, that matters.\n\nScore each idea on these five factors. Add the scores. Rank them. Then pick your primary and backup.\n\nYour primary idea is the one you commit to for the next seven days. Your backup is the fallback if something fundamental breaks. Everything else gets shelved. You can return to those ideas later if needed.\n\nDo not overthink the scoring. Use your gut combined with what you learned on Days 1 through 5. The point is to end debate, not to find mathematical certainty."
        },
        "practice": {
            "title": "The Decision Reset (3-5 minutes)",
            "content": "Before you score, reset your mental state.\n\nClose your eyes. Take three slow breaths. Notice any tightness in your body. That tension often comes from wanting to make the right choice. Acknowledge it.\n\nNow remind yourself: there is no perfect choice. There is only a choice you make and then work to validate. The goal today is forward motion, not perfection.\n\nSet a timer for 2 minutes. On paper or in your head, answer these questions without filtering:\n\n1. Which idea excites me most right now?\n2. Which idea feels most doable this week?\n3. Which idea do I keep coming back to?\n\nWrite down your answers. These are signals. Now open your eyes and begin the scoring process."
        },
        "mission": [
            {
                "task": "Complete the Decision Reset practice",
                "time": "5 min"
            },
            {
                "task": "List your top 4 ideas from Days 3 through 5",
                "time": "3 min"
            },
            {
                "task": "Score each idea on Feasibility (1 to 5)",
                "time": "5 min"
            },
            {
                "task": "Score each idea on Profitability (1 to 5)",
                "time": "5 min"
            },
            {
                "task": "Score each idea on Persuasion (1 to 5)",
                "time": "5 min"
            },
            {
                "task": "Score each idea on Efficiency (1 to 5)",
                "time": "5 min"
            },
            {
                "task": "Score each idea on Motivation (1 to 5)",
                "time": "5 min"
            },
            {
                "task": "Total scores and rank ideas from highest to lowest",
                "time": "3 min"
            },
            {
                "task": "Choose your primary idea and backup idea",
                "time": "5 min"
            },
            {
                "task": "Write your commitment: For the next 7 days, I will focus on _____",
                "time": "3 min"
            }
        ],
        "commonMistakes": "Scoring all ideas the same to avoid deciding. The point of scoring is to create separation. Be honest about differences.\n\nIgnoring motivation because it seems soft. Low motivation kills execution. If you dread the work, factor that in.\n\nPicking the hardest idea because it feels more impressive. Harder is not better. Faster feedback is better.\n\nNot committing to one primary idea. Keeping two ideas equally active splits your energy and guarantees slower progress.\n\nOverthinking the scoring. This is not a math test. Use your judgment and move on.\n\nForgetting to pick a backup. If your primary idea fails fast, you want a clear fallback so you do not stall.",
        "doneMeans": "You have scored and ranked your ideas, chosen one primary and one backup, and written a commitment sentence.",
        "reviewCTA": "Want feedback on your scoring logic? Submit your Day 6 workbook for review and get suggestions on your idea selection."
    },
    {
        "day": 7,
        "title": "Become a Detective",
        "week": 2,
        "goal": "Research your market and find a clear angle to differentiate",
        "timeEstimate": "45-55 min",
        "hook": "Competition is proof of demand. Today you study it, find the gaps, and claim your angle.",
        "lesson": {
            "title": "Why Today Matters",
            "content": "You picked an idea. Now you need to know what you are walking into. The worst mistake is to build in a vacuum. If you do not know what exists, you cannot position yourself differently.\n\nToday you become a detective. You will research competitors, study their offers, read their reviews, and look for patterns. This is not about copying. It is about understanding.\n\nHere is the good news: competition means demand. If people are already paying for something similar, there is a market. The absence of competition usually means the absence of buyers, not untapped opportunity.\n\nHere is what you are looking for:\n\nWhat do competitors offer? Study the specifics. What is included, what is not, how is it priced, how is it delivered?\n\nWhat do customers complain about? Read reviews, comments, and forum threads. Complaints are opportunities. Each frustration is a chance to do something better or different.\n\nWhat is missing? Sometimes no one offers exactly what a segment wants. That gap is your angle.\n\nYour goal is not to be the best in the world. That is unrealistic and unnecessary. Your goal is to be different enough that you have a reason to exist. You need a clear answer to: why would someone choose you instead of the others?\n\nThe answer might be: you are faster, cheaper, more personal, more specialized, local, or more trustworthy. Any angle works if it is true and you can deliver on it.\n\nBy the end of today, you will have a short statement: I am different because _____. That statement guides everything you build."
        },
        "practice": {
            "title": "The Detective Scan (5-7 minutes)",
            "content": "Set a timer for 6 minutes. You are going to do a quick reconnaissance sweep.\n\nOpen Google, YouTube, and one marketplace (Etsy, Fiverr, Upwork, or similar depending on your idea).\n\nSearch for your offer or problem in simple terms. Example: resume help, meal planning service, logo design.\n\nFor the first 3 minutes, skim results. Do not click. Just notice: how many results? What prices do you see? What promises?\n\nFor the next 3 minutes, click into 2 or 3 competitors. Skim their offer page and read 2 reviews or comments.\n\nWhen the timer ends, write down three things:\n\n1. One thing competitors do well.\n2. One thing customers complain about.\n3. One gap no one seems to fill.\n\nThese notes are your starting point for deeper research."
        },
        "mission": [
            {
                "task": "Complete the Detective Scan practice",
                "time": "7 min"
            },
            {
                "task": "Search 3 to 5 platforms for competitors (Google, YouTube, Etsy, Fiverr, Reddit, etc.)",
                "time": "10 min"
            },
            {
                "task": "Document details for 5 competitors: name, link, offer, price, main promise",
                "time": "15 min"
            },
            {
                "task": "For each competitor, note what seems weak or missing",
                "time": "10 min"
            },
            {
                "task": "Collect 5 phrases customers use in reviews or comments",
                "time": "5 min"
            },
            {
                "task": "Write 3 gap hypotheses: things you could do differently",
                "time": "5 min"
            },
            {
                "task": "Choose your differentiation angle",
                "time": "3 min"
            },
            {
                "task": "Write your statement: I am different because _____",
                "time": "3 min"
            }
        ],
        "commonMistakes": "Panicking at competition. Competition confirms demand. It is a good sign.\n\nOnly looking at the first page of Google. Check marketplaces, social media, and forums too.\n\nStopping after 2 competitors. Look at 5. Patterns appear after you see more examples.\n\nIgnoring negative reviews. Complaints are signals. They tell you what to fix.\n\nCopying competitors instead of differentiating. The goal is to find your unique angle, not to clone someone else.\n\nChoosing an angle you cannot deliver. Your differentiation must be true. Do not claim premium if you cannot deliver premium.",
        "doneMeans": "You have documented 5 competitors, found 3 gaps, and written a differentiation statement.",
        "reviewCTA": "Want feedback on your differentiation angle? Submit your Day 7 workbook for review."
    },
    {
        "day": 8,
        "title": "Have Imaginary Coffee with Your Ideal Customer",
        "week": 2,
        "goal": "Create a vivid avatar and understand what drives them to pay",
        "timeEstimate": "45-55 min",
        "hook": "Stop selling to everyone. Today you meet the one person your offer is built for.",
        "lesson": {
            "title": "Why Today Matters",
            "content": "Everyone is not your customer. If you try to serve everyone, you will resonate with no one. The most effective side hustles are built for a specific person with a specific problem.\n\nToday you create your avatar. Not a demographic profile. A real human you can picture.\n\nThink about someone who would genuinely benefit from your offer. Maybe it is someone you know. Maybe it is a version of yourself from a few years ago. Maybe it is someone you have observed online or in real life.\n\nGive them a name. Picture their day. Understand their frustration.\n\nGo beyond surface details. Yes, know their age and job. But more importantly, know what keeps them up at night. Know what they have tried and why it failed. Know what they secretly want and what they fear will happen if nothing changes.\n\nKnow their objections. What makes them hesitate to spend money? What would make them trust you? What outcome would make them feel like they got their money's worth?\n\nWhen you understand this person deeply, your marketing becomes easier. You stop guessing what to say. You just say what they need to hear.\n\nBy the end of today, you will have a one-page avatar summary. You will also write a short letter to this person. The letter is not something you send. It is an exercise to prove you understand them. If you can write it without sounding fake, you are ready to sell."
        },
        "practice": {
            "title": "The Coffee Chat Visualization (5-7 minutes)",
            "content": "Close your eyes. Imagine you are sitting across from your ideal customer at a quiet coffee shop.\n\nThey look tired. They have a problem they want to solve. They are skeptical but open.\n\nFor 2 minutes, imagine them talking. What do they say? What words do they use? What frustration shows in their voice?\n\nNow imagine yourself responding. You are not pitching. You are just listening and occasionally asking questions. What do you ask?\n\nOpen your eyes. Set a timer for 3 minutes. Write down:\n\n1. Their biggest complaint in their own words.\n2. What they tried before and why it disappointed them.\n3. What they secretly want but feel embarrassed to admit.\n\nThese notes become the foundation of your avatar."
        },
        "mission": [
            {
                "task": "Complete the Coffee Chat Visualization practice",
                "time": "7 min"
            },
            {
                "task": "Give your avatar a name and a one-line identity",
                "time": "3 min"
            },
            {
                "task": "Fill in basic profile: age range, role, location type",
                "time": "5 min"
            },
            {
                "task": "Describe their biggest frustration related to your offer",
                "time": "5 min"
            },
            {
                "task": "Describe what they fear will happen if nothing changes",
                "time": "5 min"
            },
            {
                "task": "Describe what they secretly want",
                "time": "5 min"
            },
            {
                "task": "List what they have tried before and why it failed",
                "time": "5 min"
            },
            {
                "task": "Describe what would make them trust you",
                "time": "5 min"
            },
            {
                "task": "Write 8 quick Q and A notes from your imaginary conversation",
                "time": "10 min"
            },
            {
                "task": "Write a short letter to your avatar (150 to 250 words)",
                "time": "10 min"
            }
        ],
        "commonMistakes": "Making the avatar too broad. Everyone aged 25 to 45 is not specific enough.\n\nFocusing only on demographics. Age and income matter less than problems and motivations.\n\nInventing a fictional person with no grounding in reality. Base your avatar on real observations.\n\nSkipping the letter exercise. Writing to them forces you to prove you understand them.\n\nUsing marketing language in the letter. Write like a human, not a brochure.\n\nIgnoring objections and distrust. Knowing what makes them hesitate is as important as knowing what they want.",
        "doneMeans": "You have a one-page avatar summary with profile, frustrations, desires, and a short letter written to them.",
        "reviewCTA": "Want feedback on your avatar? Submit your Day 8 workbook for review and get suggestions on deepening your understanding."
    },
    {
        "day": 9,
        "title": "Transform Your Idea into an Offer",
        "week": 2,
        "goal": "Package your idea into a clear, sellable offer with promise, pitch, and price",
        "timeEstimate": "50-60 min",
        "hook": "An idea is a thought. An offer is something someone can buy. Today you build the package.",
        "lesson": {
            "title": "Why Today Matters",
            "content": "You have an idea and an avatar. But ideas do not sell. Offers do. An offer is specific, bounded, and priced. It answers the question: what exactly do I get if I pay you?\n\nVague offers create confusion. Confusion kills sales. If a potential customer cannot understand your offer in 30 seconds, they will not buy.\n\nToday you define your offer with precision:\n\nWhat do they receive? List the deliverables. A course? A call? A template? A product? Be concrete.\n\nWhat problem does it solve? State the problem in their words, not industry jargon. If your avatar would not use a word, do not use it.\n\nWhat outcome can they expect? Outcomes are what people pay for. Not the thing itself, but what the thing does for them.\n\nHow is it delivered? In person, online, via email, on a call? Be clear.\n\nHow long does it take? Same day, a week, a month?\n\nWhat is not included? Boundaries prevent scope creep and set expectations.\n\nWhat does it cost? Price it simply. One-time, hourly, package, or subscription.\n\nYou will also write two pitches. The first is one sentence. This is your cocktail party answer to what do you do. The second is five sentences. This is for a landing page or longer conversation.\n\nFinally, you will consider a basic version and a premium version. Not because you need both, but because thinking in tiers helps clarify value.\n\nBy the end of today, you have a sellable offer. Not perfect. Not final. But clear enough that you could describe it to a stranger and they would understand."
        },
        "practice": {
            "title": "The Promise and Boundaries Exercise (4-6 minutes)",
            "content": "Set a timer for 5 minutes.\n\nAnswer these questions without stopping to edit:\n\n1. After someone pays me, what do they walk away with? (The deliverable)\n2. What changes for them? (The outcome)\n3. What am I definitely not doing for them? (The boundary)\n\nNow reread your answers. Circle any vague words. Replace them with specifics.\n\nExample: Help them with their resume becomes Rewrite their resume and record a 10-minute video explaining the changes.\n\nExample: Support during the process becomes Two 30-minute calls plus unlimited email for 14 days.\n\nSpecificity is your friend. Vague promises sound weak."
        },
        "mission": [
            {
                "task": "Complete the Promise and Boundaries exercise",
                "time": "6 min"
            },
            {
                "task": "Write your offer name",
                "time": "3 min"
            },
            {
                "task": "Write who it is for (from your Day 8 avatar)",
                "time": "3 min"
            },
            {
                "task": "Write the promise in plain language",
                "time": "5 min"
            },
            {
                "task": "List the deliverables: what exactly do they receive",
                "time": "5 min"
            },
            {
                "task": "Choose delivery format and time to deliver",
                "time": "5 min"
            },
            {
                "task": "Write what is not included",
                "time": "5 min"
            },
            {
                "task": "Write your one-sentence pitch",
                "time": "5 min"
            },
            {
                "task": "Write your five-sentence pitch",
                "time": "10 min"
            },
            {
                "task": "Set your price model and price point",
                "time": "5 min"
            },
            {
                "task": "Describe basic version and premium version differences",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Being vague about deliverables. They get a course is not enough. How many modules? How long? What format?\n\nUsing jargon the avatar would not understand. Write in their language.\n\nSkipping boundaries. Without clear limits, you risk scope creep and resentment.\n\nPricing before understanding value. Think about what outcome is worth to them, not just what it costs you.\n\nWriting the pitch in marketing speak. Write like you talk. Authenticity beats polish.\n\nTrying to be everything to everyone. A focused offer beats a broad one.\n\nForgetting risk reversal. What happens if they are not happy? Have an answer.\n\nNot thinking about where to find the first 3 customers. Your offer is useless if no one sees it.",
        "doneMeans": "You have a clear offer with name, promise, deliverables, boundaries, pitches, and price.",
        "reviewCTA": "Want feedback on your offer? Submit your Day 9 workbook for review and get suggestions on clarity and pricing."
    },
    {
        "day": 10,
        "title": "Create Your Origins Story",
        "week": 2,
        "goal": "Craft a true, simple story that builds trust and connection",
        "timeEstimate": "40-50 min",
        "hook": "People buy from people they trust. Your story is how they decide to trust you.",
        "lesson": {
            "title": "Why Today Matters",
            "content": "You have an offer. Now you need a reason for people to listen. That reason is your story.\n\nPeople do not buy from faceless businesses. They buy from humans with motives, experiences, and credibility. Your origin story answers the questions: Why are you doing this? Why should I believe you can help me?\n\nThis is not about bragging. It is not about inventing drama. It is about honest connection.\n\nA good origin story follows a simple arc:\n\nYou noticed a problem. Something bothered you or someone you cared about. You saw a gap, a frustration, a need.\n\nYou cared enough to act. Most people notice problems and do nothing. You decided to do something. Why?\n\nYou figured something out. Through experience, trial, or study, you learned how to solve it or make progress on it.\n\nNow you are sharing that solution. You are offering your knowledge, skill, or service to others who face the same problem.\n\nThat is the arc. Keep it simple and true.\n\nYour credibility does not need to be a degree or a decade of experience. It can be lived experience. It can be intensive research. It can be relatability. I struggled with this too is powerful. I spent 200 hours learning this so you do not have to is powerful.\n\nDo not fake drama. Do not exaggerate. Authenticity beats polish. If your story is simple, keep it simple. Real resonates.\n\nToday you will write three versions of your story: short (50 words), medium (150 words), and full (300 words). Each has its use. The short version is for introductions and bios. The medium is for about pages. The full is for landing pages and sales conversations."
        },
        "practice": {
            "title": "The Turning Point Reflection (4-6 minutes)",
            "content": "Set a timer for 5 minutes.\n\nClose your eyes briefly. Think back to the moment when you first noticed the problem your offer solves. Where were you? What triggered it? Who was involved?\n\nNow think about the moment you decided to act. What shifted? Was it frustration reaching a peak? Was it seeing someone else succeed? Was it a specific insight?\n\nOpen your eyes and write:\n\n1. The moment I noticed the problem was when _____.\n2. What pushed me to act was _____.\n3. What I figured out was _____.\n\nThese three answers form the skeleton of your story."
        },
        "mission": [
            {
                "task": "Complete the Turning Point Reflection practice",
                "time": "6 min"
            },
            {
                "task": "Write: when you first noticed the problem",
                "time": "5 min"
            },
            {
                "task": "Write: why you cared enough to act",
                "time": "5 min"
            },
            {
                "task": "Write: what experience or proof makes you credible",
                "time": "5 min"
            },
            {
                "task": "Write: who you want to help",
                "time": "3 min"
            },
            {
                "task": "Write: your mission in one sentence",
                "time": "3 min"
            },
            {
                "task": "Write: the turning point that made you act",
                "time": "5 min"
            },
            {
                "task": "Write your 50-word story",
                "time": "5 min"
            },
            {
                "task": "Write your 150-word story",
                "time": "7 min"
            },
            {
                "task": "Write your 300-word story",
                "time": "10 min"
            },
            {
                "task": "Choose where you will place this story",
                "time": "3 min"
            }
        ],
        "commonMistakes": "Inventing credentials you do not have. Fake stories backfire. Authenticity matters.\n\nMaking it all about you. The story should explain why you can help them, not just why you are great.\n\nBeing too vague. I always loved helping people is weak. Be specific about what, when, and how.\n\nAdding unnecessary drama. If your story is simple, keep it simple. Forced drama feels fake.\n\nUsing marketing language. Write like a human talking to another human.\n\nForgetting the mission. Your story should end with what you are offering and why it matters.\n\nNot tying the story to the offer. The story should naturally lead to why your offer exists.\n\nWriting only one version. Different contexts need different lengths. Write all three.",
        "doneMeans": "You have a true origin story in three lengths (50, 150, 300 words) and know where you will use it.",
        "reviewCTA": "Want feedback on your story? Submit your Day 10 workbook for review and get suggestions on clarity and connection."
    },
    {
        "day": 11,
        "title": "Assemble the Nuts and Bolts",
        "week": 3,
        "goal": "List everything you need to launch your offer",
        "timeEstimate": "25-35 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "Before you can sell, you need to build. Today you'll create a comprehensive list of everything required to make your offer real—tools, content, processes, and platforms.\n\nThis is practical logistics work. What tools do you need? What content must you create? What accounts do you need to set up? What processes need documentation?\n\nThe goal is a clear checklist you can execute over the coming days. Vague plans create paralysis. Specific checklists create momentum."
        },
        "mission": [
            {
                "task": "List all tools and platforms you'll need (be specific)",
                "time": "10 min"
            },
            {
                "task": "List all content you need to create (sales page, product, etc.)",
                "time": "10 min"
            },
            {
                "task": "List all accounts you need to set up",
                "time": "5 min"
            },
            {
                "task": "Prioritize: what must happen before you can accept payment?",
                "time": "10 min"
            }
        ],
        "commonMistakes": "Don't overcomplicate. The minimum viable version needs fewer things than you think. Ask: 'Can I launch without this?' If yes, defer it.",
        "doneMeans": "You have a prioritized checklist of exactly what you need to launch."
    },
    {
        "day": 12,
        "title": "Decide How to Price Your Offer",
        "week": 3,
        "goal": "Set your initial price with clear reasoning",
        "timeEstimate": "30-40 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "Pricing is psychology as much as math. Today you'll decide what to charge, grounded in research and strategy rather than guesswork.\n\nConsider three anchors: cost-based (what does it cost you to deliver?), competition-based (what do alternatives cost?), and value-based (what's it worth to the customer?).\n\nFor side hustles, I recommend starting slightly lower than you're comfortable with, then raising prices as you gain evidence of value. Your first customers are learning opportunities as much as revenue.\n\nRemember: you can always change your price. This isn't permanent—it's a starting point."
        },
        "mission": [
            {
                "task": "Calculate your costs to deliver (time, materials, tools)",
                "time": "10 min"
            },
            {
                "task": "Document competitor pricing from your Day 7 research",
                "time": "5 min"
            },
            {
                "task": "Estimate the value to your customer (what problem is worth solving?)",
                "time": "10 min"
            },
            {
                "task": "Set your initial price and write the reasoning",
                "time": "10 min"
            }
        ],
        "commonMistakes": "Don't race to the bottom on price. Cheap signals low value. Also don't price based on your insecurity—price based on the value delivered.",
        "doneMeans": "You have a specific price with written reasoning based on costs, competition, and value."
    },
    {
        "day": 13,
        "title": "Create a Side Hustle Shopping List",
        "week": 3,
        "goal": "Purchase or sign up for everything on your Day 11 list",
        "timeEstimate": "30-45 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "Planning is easy. Spending money makes things real. Today you'll actually acquire the tools, domains, accounts, and resources you need.\n\nThis is an execution day. Take your prioritized list from Day 11 and start checking items off. Set up accounts. Buy the domain. Subscribe to the tools.\n\nKeep costs minimal at first. Free trials are your friend. You can upgrade when you have revenue. The goal is to have everything in place, not to have everything perfect."
        },
        "mission": [
            {
                "task": "Review your Day 11 checklist of required items",
                "time": "5 min"
            },
            {
                "task": "Sign up for all necessary accounts and tools",
                "time": "20 min"
            },
            {
                "task": "Purchase any essential items (domain, templates, materials)",
                "time": "15 min"
            },
            {
                "task": "Document all login credentials and costs",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Don't buy premium tools before you've validated the idea. Start with free or cheap options. Upgrade when you have customers.",
        "doneMeans": "Every essential tool and account is set up and ready to use."
    },
    {
        "day": 14,
        "title": "Set Up a Way to Get Paid",
        "week": 3,
        "goal": "Configure your payment processing system",
        "timeEstimate": "25-35 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "You can't earn money if people can't pay you. Today you'll set up the infrastructure to accept payments, making your side hustle legitimately operational.\n\nFor most side hustles, this means a payment processor (Stripe, PayPal, Gumroad, etc.) and potentially a simple checkout page. Don't overcomplicate it.\n\nThe key is removing friction. The fewer clicks between 'I want this' and 'I bought this,' the better. Test the flow yourself before asking customers to use it."
        },
        "mission": [
            {
                "task": "Choose a payment platform (Stripe, PayPal, Gumroad, etc.)",
                "time": "10 min"
            },
            {
                "task": "Set up your account and connect bank/payout info",
                "time": "15 min"
            },
            {
                "task": "Create your first product/price in the system",
                "time": "5 min"
            },
            {
                "task": "Test the checkout flow yourself (use test mode if available)",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Don't skip the test transaction. Problems with payment flow kill sales. Also, understand the fees—they affect your real profit.",
        "doneMeans": "You have a working payment system that can accept money for your offer."
    },
    {
        "day": 15,
        "title": "Design Your First Workflow",
        "week": 3,
        "goal": "Document exactly how you'll deliver after someone buys",
        "timeEstimate": "25-35 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "What happens after someone clicks 'buy'? If you don't know, you're not ready to sell. Today you'll map the complete customer experience from purchase to delivery.\n\nThis workflow becomes your operating system. Step 1, step 2, step 3—clear enough that you could follow it at 6 AM after bad sleep.\n\nFor products, this might be automated. For services, it might involve scheduling, communication, and delivery. Either way, document it now so you're not scrambling later."
        },
        "mission": [
            {
                "task": "Map every step after purchase: confirmation, delivery, follow-up",
                "time": "15 min"
            },
            {
                "task": "Identify which steps can be automated and which require your time",
                "time": "5 min"
            },
            {
                "task": "Draft any templates you'll need (emails, messages, documents)",
                "time": "10 min"
            },
            {
                "task": "Set up basic automation if applicable (email sequences, etc.)",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Don't assume you'll figure it out later. The first customer experience shapes whether they recommend you or complain about you.",
        "doneMeans": "You have a documented, step-by-step workflow for what happens after someone purchases."
    },
    {
        "day": 16,
        "title": "Spend 10 Percent More Time on the Most Important",
        "week": 4,
        "goal": "Identify and focus on your highest-leverage activities",
        "timeEstimate": "20-30 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "You've done a lot of preparation. Before launch, let's make sure you're focused on what actually matters.\n\nNot all activities are equal. Some things feel productive but don't move you toward revenue. Others feel simple but create disproportionate results. Today you identify the difference.\n\nLook at everything on your plate. What directly leads to someone paying you? That's where your time should go. Everything else is secondary.\n\n10% more time on the right things beats 50% more time on the wrong things."
        },
        "mission": [
            {
                "task": "List all tasks remaining before launch",
                "time": "5 min"
            },
            {
                "task": "Categorize: which directly lead to revenue vs. nice-to-have?",
                "time": "10 min"
            },
            {
                "task": "Defer or delete anything that's not essential for first sale",
                "time": "5 min"
            },
            {
                "task": "Block time for the highest-leverage remaining tasks",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Don't confuse busy with productive. Logo design, website polish, and social media setup are seductive but rarely essential for the first sale.",
        "doneMeans": "You've ruthlessly prioritized your remaining tasks and deferred the non-essential."
    },
    {
        "day": 17,
        "title": "Publish Your Offer!",
        "week": 4,
        "goal": "Make your offer available for purchase somewhere public",
        "timeEstimate": "35-45 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "This is the day. Whatever you've built—simple or complex—it's time to make it available to the world. The gap between 'working on it' and 'it's live' is one click.\n\nPublishing doesn't mean perfect. It means available. Someone, somewhere, can now see your offer and decide whether to buy.\n\nThis might be a simple landing page, a product listing on a marketplace, or even a direct message to your first prospect. The format matters less than the action.\n\nHit publish. You can improve it later."
        },
        "mission": [
            {
                "task": "Finalize your sales page/listing with offer details and price",
                "time": "15 min"
            },
            {
                "task": "Test the complete flow: view offer, click buy, complete payment",
                "time": "10 min"
            },
            {
                "task": "Publish it—make it accessible via a live URL or marketplace",
                "time": "5 min"
            },
            {
                "task": "Share the link somewhere (one post, one message, one email)",
                "time": "10 min"
            }
        ],
        "commonMistakes": "Don't delay for perfection. A live imperfect offer beats a perfect offer that no one can see. You can iterate after you publish.",
        "doneMeans": "Your offer has a live, public URL and you've shared it with at least one person or channel."
    },
    {
        "day": 18,
        "title": "Sell Like a Girl Scout",
        "week": 4,
        "goal": "Directly ask potential customers to buy",
        "timeEstimate": "30-40 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "Girl Scouts don't wait for customers to find their cookie table. They knock on doors, set up in high-traffic areas, and ask directly. Today, you do the same.\n\nDirect outreach isn't spam—it's service. If your offer genuinely helps people, telling them about it is a favor, not an imposition.\n\nThe key is targeting. Don't blast everyone; reach out to people who actually fit your ideal customer profile. Personalize. Explain why you thought of them. Make it easy to say yes or no."
        },
        "mission": [
            {
                "task": "Identify 10 specific people who match your ideal customer profile",
                "time": "10 min"
            },
            {
                "task": "Write a personalized outreach message (not a template)",
                "time": "10 min"
            },
            {
                "task": "Send your offer to all 10 people via appropriate channels",
                "time": "15 min"
            },
            {
                "task": "Track responses: who replied, what did they say?",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Don't apologize for selling. 'Sorry to bother you' signals that you don't believe in your offer. Be direct and confident.",
        "doneMeans": "You've personally reached out to 10 potential customers with your offer."
    },
    {
        "day": 19,
        "title": "Ask Ten People for Help",
        "week": 4,
        "goal": "Leverage your network for introductions and feedback",
        "timeEstimate": "25-35 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "Beyond direct sales, your network can amplify your reach. Today you ask for help—not sales, but introductions, shares, and feedback.\n\nPeople want to help, but they need to be asked specifically. 'Can you share this?' is better than hoping they notice. 'Do you know anyone who…?' is better than waiting for referrals.\n\nThe ask should be easy to fulfill. Don't ask people to write a novel—ask them to forward an email, share a link, or make an introduction."
        },
        "mission": [
            {
                "task": "Identify 10 people in your network who might help (not buy)",
                "time": "10 min"
            },
            {
                "task": "Write a simple ask: share, introduce, or give feedback",
                "time": "10 min"
            },
            {
                "task": "Send your ask to all 10 people",
                "time": "10 min"
            },
            {
                "task": "Note: who said yes? What did they offer?",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Don't be vague. 'Let me know if you can help' gets ignored. 'Would you share this with your newsletter?' gets action.",
        "doneMeans": "You've asked 10 people for specific help and documented their responses."
    },
    {
        "day": 20,
        "title": "Test, Test, and Test Again",
        "week": 4,
        "goal": "Gather feedback and iterate on your offer",
        "timeEstimate": "30-40 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "By now you've put your offer in front of people. Some may have bought; many probably haven't. Today is about understanding why.\n\nFeedback is data. Why did people say no? What questions did they ask? What confused them? Each response is a clue for improving your offer.\n\nDon't get defensive about feedback. Your first version was a hypothesis. Real market response tells you whether that hypothesis was right."
        },
        "mission": [
            {
                "task": "Review all responses from Days 17-19: what patterns emerge?",
                "time": "15 min"
            },
            {
                "task": "Identify the most common objections or questions",
                "time": "10 min"
            },
            {
                "task": "Make at least one improvement to your offer or messaging",
                "time": "10 min"
            },
            {
                "task": "Follow up with anyone who said 'maybe' or asked questions",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Don't take rejection personally. Every 'no' is information about how to get to 'yes.' Stay curious, not wounded.",
        "doneMeans": "You've documented feedback patterns and made at least one concrete improvement."
    },
    {
        "day": 21,
        "title": "Burn Down the Furniture Store",
        "week": 4,
        "goal": "Create urgency with a legitimate limited-time offer",
        "timeEstimate": "25-35 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "Sometimes people need a reason to act now instead of 'later' (which usually means 'never'). Today you create legitimate urgency around your offer.\n\nThis isn't about fake scarcity or manipulation. It's about giving people a real reason to decide: a limited-time discount, a bonus that expires, a cohort that's filling up.\n\nUrgency works because it forces a decision. Without a deadline, 'maybe' stretches indefinitely. With a deadline, people must choose."
        },
        "mission": [
            {
                "task": "Design a time-limited offer (discount, bonus, or limited availability)",
                "time": "10 min"
            },
            {
                "task": "Set a specific deadline (real, not fake)",
                "time": "5 min"
            },
            {
                "task": "Communicate the offer to your audience (new post, email, update)",
                "time": "15 min"
            },
            {
                "task": "Prepare to follow up before the deadline expires",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Don't create fake urgency that you'll extend later. People remember and trust erodes. If the deadline passes, honor it.",
        "doneMeans": "You have a published time-limited offer with a real deadline."
    },
    {
        "day": 22,
        "title": "Frame Your First Dollar",
        "week": 4,
        "goal": "Celebrate and document your first sale",
        "timeEstimate": "20-30 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "Whether you've made a sale already or you're still working toward it, today is about the milestone of the first dollar.\n\nIf you've made a sale: celebrate it. Document exactly what happened—the channel, the person, the moment. This is the proof that your side hustle works.\n\nIf you haven't yet: analyze why and plan your next actions. The first sale often takes longer than expected. That's normal. Keep going.\n\nThe first dollar matters more than the amount. It's proof of concept."
        },
        "mission": [
            {
                "task": "Document any sales so far: amount, channel, customer details",
                "time": "10 min"
            },
            {
                "task": "If no sale yet: list the three most likely paths to first sale",
                "time": "10 min"
            },
            {
                "task": "Identify what made the sale happen (or what's blocking it)",
                "time": "5 min"
            },
            {
                "task": "Write a 'first dollar story' you could share",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Don't discount the first sale because it was 'just a friend' or 'only $20.' Revenue is revenue. Start celebrating small wins.",
        "doneMeans": "You've documented your first sale (or a concrete plan to get it) and reflected on what worked."
    },
    {
        "day": 23,
        "title": "Track Your Progress and Decide on Next Steps",
        "week": 4,
        "goal": "Review your metrics and plan for the coming weeks",
        "timeEstimate": "25-35 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "Data beats intuition. Today you step back and look at the numbers: views, clicks, responses, sales. What story do they tell?\n\nWithout tracking, you're guessing. With tracking, you're learning. Even if the numbers are small, the patterns reveal what's working and what's not.\n\nBased on this data, you'll make informed decisions about where to focus your energy in the coming weeks."
        },
        "mission": [
            {
                "task": "Gather all metrics: page views, click rates, responses, sales",
                "time": "10 min"
            },
            {
                "task": "Calculate conversion rates at each stage of your funnel",
                "time": "10 min"
            },
            {
                "task": "Identify the biggest bottleneck (where are people dropping off?)",
                "time": "5 min"
            },
            {
                "task": "List three specific actions to improve the bottleneck",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Don't panic over small sample sizes. A 0% conversion rate from 5 visitors means nothing statistically. Focus on getting more data first.",
        "doneMeans": "You have a documented metrics dashboard and a list of specific improvements to make."
    },
    {
        "day": 24,
        "title": "Grow What Works, Let Go of What Doesn't",
        "week": 4,
        "goal": "Double down on successes and abandon failures",
        "timeEstimate": "25-35 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "Not everything you tried worked. That's expected. Today you make hard decisions about what to continue, what to amplify, and what to kill.\n\nEffective strategy is as much about stopping as starting. Every minute spent on something that isn't working is a minute not spent on something that could.\n\nLook at your data from Day 23. What channel brought the most interest? What message resonated? What fell flat? Invest more in winners, cut the losers."
        },
        "mission": [
            {
                "task": "Identify your top-performing channel, message, and tactic",
                "time": "10 min"
            },
            {
                "task": "Identify what clearly isn't working (cut it)",
                "time": "10 min"
            },
            {
                "task": "Plan how to 2x your effort on what's working",
                "time": "10 min"
            },
            {
                "task": "Update your strategy document with these decisions",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Don't keep investing in tactics just because you spent time on them. Sunk cost is irrelevant. Only future potential matters.",
        "doneMeans": "You've made concrete decisions about what to invest in and what to stop."
    },
    {
        "day": 25,
        "title": "Look for Money Lying Under a Rock",
        "week": 4,
        "goal": "Find overlooked revenue opportunities in your existing setup",
        "timeEstimate": "25-35 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "Sometimes the best opportunities are hiding in plain sight. Today you look for money you're leaving on the table—upsells, add-ons, referral opportunities, or underpriced services.\n\nAsk: who's already interested but hasn't bought? What else could current customers need? Where is demand showing up that you haven't addressed?\n\nThese 'rocks' often represent easier revenue than acquiring entirely new customers. The hardest sale is the first one; subsequent sales to satisfied customers are much easier."
        },
        "mission": [
            {
                "task": "List everyone who showed interest but didn't buy",
                "time": "10 min"
            },
            {
                "task": "Identify potential upsells or add-ons for current customers",
                "time": "10 min"
            },
            {
                "task": "Look for referral opportunities from happy customers",
                "time": "5 min"
            },
            {
                "task": "Choose one 'rock' to pursue this week",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Don't only chase new customers while ignoring warm leads. The people who already said 'maybe' are often closest to saying 'yes.'",
        "doneMeans": "You've identified hidden revenue opportunities and picked one to pursue."
    },
    {
        "day": 26,
        "title": "Get It Out of Your Head",
        "week": 4,
        "goal": "Document your systems so the side hustle can run without you",
        "timeEstimate": "30-40 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "Right now, your side hustle lives in your head. That's a risk. If you get busy with life, sick, or just need a break, everything stops.\n\nToday you document. Write down your workflows, your systems, your checklists. Create simple documentation that your future self (or someone else) could follow.\n\nThis isn't about building a corporation. It's about creating clarity and resilience. A documented system is easier to improve, easier to delegate, and easier to resume after a break."
        },
        "mission": [
            {
                "task": "Document your customer acquisition workflow (how do people find you?)",
                "time": "10 min"
            },
            {
                "task": "Document your sales process (how do people buy?)",
                "time": "10 min"
            },
            {
                "task": "Document your delivery process (how do you fulfill?)",
                "time": "10 min"
            },
            {
                "task": "Create a one-page 'operations summary'",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Don't over-document. You're not writing a corporate manual. Simple bullet points are fine. Clarity beats comprehensiveness.",
        "doneMeans": "Your core processes are documented and you could hand them to someone else."
    },
    {
        "day": 27,
        "title": "Back to the Future",
        "week": 4,
        "goal": "Set your vision and plan for the next 90 days",
        "timeEstimate": "30-40 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "Congratulations—you've completed the 27-day program. You've moved from idea to offer to (hopefully) first sales. That's not nothing. That's real progress.\n\nBut a side hustle isn't a project; it's an ongoing practice. Today you zoom out and plan what happens next.\n\nWhat did you learn? What would you do differently? What are your goals for the next 90 days? The work continues, but now you have momentum, experience, and data to guide you."
        },
        "mission": [
            {
                "task": "Write a 'retrospective': what worked, what didn't, what surprised you",
                "time": "15 min"
            },
            {
                "task": "Set specific goals for the next 90 days (revenue, customers, product)",
                "time": "10 min"
            },
            {
                "task": "Identify the single biggest lever to pull in the next month",
                "time": "5 min"
            },
            {
                "task": "Schedule recurring time for your side hustle going forward",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Don't stop now because 'the program is over.' The program was the beginning. The side hustle continues.",
        "doneMeans": "You've completed a retrospective, set 90-day goals, and scheduled ongoing time for your side hustle."
    }
]