[
    {
        "day": 1,
        "title": "Predict the Future",
        "week": 1,
        "goal": "Identify emerging trends and opportunities you could capitalize on",
        "timeEstimate": "25-35 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "Before you generate specific business ideas, you need to understand where the world is heading. The most successful side hustles aren't built on what's popular today—they're built on what's becoming popular tomorrow.\n\nToday you'll practice futures thinking: looking at current trends in technology, behavior, and culture, then extrapolating where they lead. This isn't about predicting the exact future—it's about noticing patterns that others miss.\n\nThe goal isn't to be right about everything. It's to develop a list of potential opportunity spaces where your skills and interests might intersect with growing demand.\n\nPay attention to what's changing in your industry, your community, and your daily life. The seeds of your side hustle might already be visible if you know where to look."
        },
        "mission": [
            {
                "task": "List 5 trends you've noticed in the past year (technology, behavior, culture)",
                "time": "10 min"
            },
            {
                "task": "For each trend, write one prediction about where it leads in 2-3 years",
                "time": "10 min"
            },
            {
                "task": "Identify 3 potential opportunity gaps these trends might create",
                "time": "10 min"
            },
            {
                "task": "Note any personal skills or interests that connect to these gaps",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Don't overthink your predictions. You're not trying to write a perfect forecast—you're warming up your opportunity-spotting muscles. Quantity matters more than precision right now.",
        "doneMeans": "You have at least 5 trends documented, 5 predictions written, and 3 potential opportunity areas identified."
    },
    {
        "day": 2,
        "title": "Learn How Money Grows on Trees",
        "week": 1,
        "goal": "Understand the different ways side hustles generate income",
        "timeEstimate": "20-30 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "Not all side hustles work the same way financially. Today you'll learn the fundamental business models that generate side income, so you can evaluate ideas more effectively.\n\nThere are essentially three ways to make money: sell a product (physical or digital), sell a service (your time and expertise), or earn through other means (affiliate, advertising, licensing). Each has trade-offs in terms of startup cost, time investment, and scalability.\n\nProducts can be sold while you sleep but require upfront creation. Services start fast but trade time for money. Hybrid models exist but add complexity.\n\nUnderstanding these models now will help you evaluate your ideas more rigorously in the coming days. Don't commit to a model yet—just build awareness of your options."
        },
        "mission": [
            {
                "task": "Write down 3 examples of product-based side hustles you've seen",
                "time": "5 min"
            },
            {
                "task": "Write down 3 examples of service-based side hustles",
                "time": "5 min"
            },
            {
                "task": "For each of your Day 1 opportunity gaps, identify which model fits best",
                "time": "10 min"
            },
            {
                "task": "Note your personal preference: do you lean toward products or services?",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Don't fall into the trap of thinking one model is 'better' than another. The best model is the one that matches your skills, available time, and goals.",
        "doneMeans": "You can clearly distinguish between product and service models, and you've mapped your opportunity areas to potential business models."
    },
    {
        "day": 3,
        "title": "Brainstorm, Borrow, or Steal Ideas",
        "week": 1,
        "goal": "Generate a large quantity of potential side hustle ideas",
        "timeEstimate": "35-45 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "Today is about quantity, not quality. You're going to generate as many side hustle ideas as possible using three different approaches.\n\nFirst, pure brainstorming: what could you create or offer based on your skills, interests, and the opportunities you identified? Let your mind wander without judging the ideas.\n\nSecond, borrowing: what's working for others that you could adapt? Look at successful side hustles in adjacent industries or different markets. Adaptation is legitimate innovation.\n\nThird, combination: what happens when you mix two unrelated concepts? Some of the best ideas come from connecting things that don't obviously belong together.\n\nDon't filter yourself. Bad ideas often lead to good ones. The goal is volume—you'll evaluate and filter in the coming days."
        },
        "mission": [
            {
                "task": "Brainstorm: Write 10 ideas based purely on your own skills and interests",
                "time": "10 min"
            },
            {
                "task": "Borrow: Find 5 successful side hustles online and adapt them to your context",
                "time": "15 min"
            },
            {
                "task": "Combine: Pick 3 random combinations from your list—what weird ideas emerge?",
                "time": "10 min"
            },
            {
                "task": "Review your full list and star your top 5 favorites (gut feeling only)",
                "time": "5 min"
            }
        ],
        "commonMistakes": "The biggest mistake is self-censoring. 'That's stupid' or 'Someone's already doing that' kills creativity. Write everything down. Filter later.",
        "doneMeans": "You have at least 15 ideas documented and 5 starred as potential favorites."
    },
    {
        "day": 4,
        "title": "Weigh the Obstacles and Opportunities of Each Idea",
        "week": 1,
        "goal": "Evaluate your ideas for feasibility and potential",
        "timeEstimate": "30-40 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "Ideas are cheap. Execution is expensive. Today you'll start filtering your idea list by honestly assessing what each idea requires and what it might return.\n\nFor each of your top ideas, consider: What's the startup cost (money and time)? What skills do you already have? What would you need to learn? Who would pay for this? How big is that market?\n\nAlso consider obstacles: What could go wrong? What's the competition like? What would make this hard for you specifically?\n\nThe goal isn't to find the 'perfect' idea—that doesn't exist. You're looking for ideas where the opportunity outweighs the obstacles given your specific situation."
        },
        "mission": [
            {
                "task": "Take your 5 starred ideas from Day 3",
                "time": "2 min"
            },
            {
                "task": "For each idea, list the required startup resources (time, money, skills)",
                "time": "15 min"
            },
            {
                "task": "For each idea, list the potential obstacles and risks",
                "time": "10 min"
            },
            {
                "task": "For each idea, estimate the potential upside (income, learning, connections)",
                "time": "10 min"
            }
        ],
        "commonMistakes": "Don't underestimate obstacles or overestimate opportunities. Be realistic. Also don't over-analyze—you're making educated guesses, not certainties.",
        "doneMeans": "Each of your 5 ideas has documented resources required, obstacles, and potential upside."
    },
    {
        "day": 5,
        "title": "Forecast Your Profit on the Back of a Napkin",
        "week": 1,
        "goal": "Do a fast profit forecast to test if your top idea is worth pursuing",
        "timeEstimate": "45-60 min",
        "hook": "Your idea means nothing until the math works. Today, you test viability in 30 minutes with a napkin and basic arithmetic.",
        "lesson": {
            "title": "Why Today Matters",
            "content": "Most people skip this step. They dive into building, branding, and perfecting before they know if the numbers make sense. Then, six months later, they wonder why they are exhausted and broke. You will not be that person.\n\nToday is about protection. You are protecting your future time and energy by doing simple math now. If the numbers look bad, you find out today, not after you have invested hundreds of hours. If the numbers look good, you move forward with confidence instead of hope.\n\nHere is the truth about profit forecasting: it does not need to be precise. You are not submitting a report to investors. You are testing whether an idea is worth your attention. Round numbers are fine. Estimates are expected. The goal is direction, not decimals.\n\nYou will work with three core numbers: what you charge, how many you sell, and what it costs to deliver. Multiply the first two, subtract the third, and you have profit. That is the entire formula. Everything else is detail.\n\nThe hard part is not the math. The hard part is being honest about your assumptions. People consistently overestimate how many sales they will get and underestimate how much time each sale takes. Today, you will build two scenarios: one conservative and one optimistic. The conservative scenario assumes things go slower than you hope. The optimistic scenario assumes your best reasonable case. Reality usually lands somewhere between.\n\nOne more thing: your time has a cost. If you spend 10 hours a week on a side hustle that generates $100 per month, you are earning $2.50 per hour. That might be fine if you love the work and see growth potential. But you should know that number, not discover it accidentally.\n\nBy the end of today, you will have a simple forecast that tells you whether this idea deserves your next three weeks. No guessing. No hoping. Just numbers on paper that either say keep going or try another idea."
        },
        "practice": {
            "title": "The Assumption Check (2-7 minutes)",
            "content": "Before you touch any numbers, take a few minutes to calm the math anxiety and surface your hidden assumptions.\n\nSit quietly for 30 seconds. Notice any tension you feel about money or math. Acknowledge it. This exercise is not a test. There are no wrong answers, only honest ones.\n\nOn a blank piece of paper or in a notes app, complete these sentences without overthinking:\n\n1. I think I could charge $____ for this.\n2. I think I could realistically sell ____ per month.\n3. I think each sale would take me about ____ minutes to deliver.\n4. I think my monthly costs would be around $____.\n\nDo not research. Do not calculate. Just write your gut answers.\n\nNow look at those numbers. Ask yourself: where did these come from? Are they based on research, comparison, or pure imagination? Put a star next to any number that feels more like a guess than an estimate.\n\nThis practice surfaces the assumptions you are about to test. Now you know which numbers need extra scrutiny."
        },
        "mission": [
            {
                "task": "Complete the Assumption Check practice above",
                "time": "3 min"
            },
            {
                "task": "Write down your chosen idea name and what the offer is",
                "time": "5 min"
            },
            {
                "task": "Research 2 to 3 comparable offers and note their prices",
                "time": "10 min"
            },
            {
                "task": "Set three price options: low, middle, high",
                "time": "5 min"
            },
            {
                "task": "Estimate conservative and optimistic monthly sales for each price",
                "time": "10 min"
            },
            {
                "task": "List your direct costs per sale and monthly fixed costs",
                "time": "10 min"
            },
            {
                "task": "Estimate minutes to fulfill one sale",
                "time": "5 min"
            },
            {
                "task": "Calculate monthly revenue, costs, and profit for both scenarios",
                "time": "10 min"
            },
            {
                "task": "Answer: Is this idea worth pursuing? Write your decision.",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Underpricing because of fear. New sellers often set prices too low because they worry no one will pay. Check comparable offers. Your price should be based on value and market, not insecurity.\n\nIgnoring time cost. If you spend 5 hours per sale and charge $50, you are earning $10 per hour before expenses. Factor your time in when judging viability.\n\nUsing optimistic numbers only. Everyone wants to believe the best case. Build a conservative scenario first. If the conservative numbers work, the optimistic ones are a bonus.\n\nForgetting recurring costs. Software subscriptions, transaction fees, and supplies add up. List every monthly cost, even small ones.\n\nSkipping comparable research. You cannot estimate your price in a vacuum. Spend 10 minutes finding similar offers and their price ranges.\n\nTreating the forecast as permanent. This is a snapshot based on current assumptions. It will change as you learn more. The goal is not perfection, just a checkpoint.",
        "doneMeans": "You have calculated profit for both conservative and optimistic scenarios, compared them to your target, and made a clear decision about whether to continue with this idea.",
        "reviewCTA": "Want a second opinion on your numbers? Submit your Day 5 workbook for review and get feedback on your pricing logic and profit assumptions within 48 hours."
    },
    {
        "day": 6,
        "title": "Use the Side Hustle Selector to Compare Ideas",
        "week": 2,
        "goal": "Score and rank your ideas using a systematic framework",
        "timeEstimate": "30-40 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "You've brainstormed, evaluated obstacles, and run basic numbers. Now it's time to make a decision. Today you'll use a scoring system to compare your ideas objectively.\n\nThe Side Hustle Selector evaluates ideas across five dimensions: Feasibility (can you actually do this?), Profitability (is the math attractive?), Persuasion (can you explain why people would pay?), Efficiency (does this match your available time?), and Motivation (does this excite you?).\n\nScore each idea 1-5 on each dimension. Total the scores. The highest-scoring idea is your front-runner—but it's not final. Trust the process, but also trust your gut."
        },
        "mission": [
            {
                "task": "Set up a simple scoring matrix (5 ideas × 5 dimensions)",
                "time": "5 min"
            },
            {
                "task": "Score each idea 1-5 on Feasibility, Profitability, Persuasion, Efficiency, Motivation",
                "time": "20 min"
            },
            {
                "task": "Total the scores and rank your ideas",
                "time": "5 min"
            },
            {
                "task": "Reflect: does the top idea feel right? If not, why?",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Don't let analysis paralysis set in. The scoring system is a guide, not a dictator. If the numbers say one thing but your gut says another, that's worth exploring.",
        "doneMeans": "Your 5 ideas are scored and ranked, and you've identified your top 1-2 ideas to pursue."
    },
    {
        "day": 7,
        "title": "Become a Detective",
        "week": 2,
        "goal": "Research your chosen idea and its market thoroughly",
        "timeEstimate": "35-45 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "You've chosen your idea. Now you need to understand the landscape you're entering. Today you become a detective, researching everything relevant to your side hustle.\n\nWho else is doing something similar? How do they price it? Where do they find customers? What do reviews say? What are people complaining about?\n\nThis isn't about copying competitors—it's about understanding the market. Gaps in competitor offerings become your opportunities. Common complaints become problems you can solve.\n\nDon't just research—document. You'll reference this research throughout the program."
        },
        "mission": [
            {
                "task": "Find 5 competitors or similar offerings (Google, marketplaces, social media)",
                "time": "15 min"
            },
            {
                "task": "Document their pricing, positioning, and customer feedback",
                "time": "15 min"
            },
            {
                "task": "Identify gaps: what are they missing or doing poorly?",
                "time": "10 min"
            },
            {
                "task": "Note any insights that change how you think about your idea",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Don't panic if you find competition. Competition means there's demand. The absence of competition often means there's no market.",
        "doneMeans": "You have documented research on 5+ competitors with notes on gaps and opportunities."
    },
    {
        "day": 8,
        "title": "Have Imaginary Coffee with Your Ideal Customer",
        "week": 2,
        "goal": "Create a detailed profile of who you're serving",
        "timeEstimate": "25-35 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "You can't sell to 'everyone.' Today you'll get specific about exactly who your side hustle serves—so specific that you could spot them at a coffee shop.\n\nThe ideal customer exercise isn't about demographics alone. Yes, know their age, location, and job. But more importantly, know their problems, desires, and daily frustrations.\n\nWhat keeps them up at night? What solutions have they tried? Why didn't those work? The more vividly you can picture this person, the more effectively you can create something they actually want."
        },
        "mission": [
            {
                "task": "Describe your ideal customer's demographics (age, job, location, income)",
                "time": "10 min"
            },
            {
                "task": "Describe their biggest problem related to your offering",
                "time": "10 min"
            },
            {
                "task": "List solutions they've tried and why those failed",
                "time": "10 min"
            },
            {
                "task": "Write a one-paragraph 'day in the life' of this person",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Don't create a fictional perfect customer. Base this on real observations—people you've met, reviews you've read, forums you've browsed.",
        "doneMeans": "You have a vivid, specific profile of your ideal customer including their problems and failed solutions."
    },
    {
        "day": 9,
        "title": "Transform Your Idea into an Offer",
        "week": 2,
        "goal": "Define exactly what you're selling and why it matters",
        "timeEstimate": "30-40 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "An idea is not an offer. An offer is specific: this is what you get, this is what it costs, this is why you should care. Today you transform your idea into something someone can actually say yes or no to.\n\nA strong offer answers: What exactly does the customer receive? What problem does it solve? What outcome does it create? Why is it worth the price?\n\nThe clearer your offer, the easier it is to sell. Vague offers create confusion. Confusion kills sales.\n\nDon't worry about perfection—your offer will evolve. But you need a starting point to test."
        },
        "mission": [
            {
                "task": "Write exactly what the customer receives (be specific, not vague)",
                "time": "10 min"
            },
            {
                "task": "Write the primary problem it solves (in their words, not industry jargon)",
                "time": "10 min"
            },
            {
                "task": "Write the transformation/outcome they can expect",
                "time": "10 min"
            },
            {
                "task": "Draft a one-sentence pitch: 'I help [who] do [what] so that [result]'",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Don't list features—describe outcomes. Customers don't buy what something is; they buy what it does for them.",
        "doneMeans": "You have a clear, specific offer with deliverables, problem solved, outcome promised, and a one-sentence pitch."
    },
    {
        "day": 10,
        "title": "Create Your Origins Story",
        "week": 2,
        "goal": "Craft a compelling narrative about why you created this",
        "timeEstimate": "25-35 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "People buy from people they trust. Your origin story builds that trust by showing why you care about this problem and why you're the right person to solve it.\n\nThis isn't about bragging or credentials. It's about connection. What's your relationship to this problem? Did you struggle with it yourself? Did you see others struggle?\n\nA good origin story follows a simple arc: I noticed a problem, I cared about solving it, I figured something out, and now I'm sharing it.\n\nKeep it authentic. People can smell manufactured stories. If your origin is simple, keep it simple."
        },
        "mission": [
            {
                "task": "Write how you first encountered this problem or opportunity",
                "time": "10 min"
            },
            {
                "task": "Describe what made you care enough to act",
                "time": "10 min"
            },
            {
                "task": "Explain what qualifies you to solve this (experience, skills, perspective)",
                "time": "10 min"
            },
            {
                "task": "Craft a 3-4 sentence origin story you could share publicly",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Don't invent credentials you don't have. Authenticity beats polish. Also, don't make the story about you—make it about why you can help them.",
        "doneMeans": "You have a genuine, shareable origin story that explains why you're doing this."
    },
    {
        "day": 11,
        "title": "Assemble the Nuts and Bolts",
        "week": 3,
        "goal": "List everything you need to launch your offer",
        "timeEstimate": "25-35 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "Before you can sell, you need to build. Today you'll create a comprehensive list of everything required to make your offer real—tools, content, processes, and platforms.\n\nThis is practical logistics work. What tools do you need? What content must you create? What accounts do you need to set up? What processes need documentation?\n\nThe goal is a clear checklist you can execute over the coming days. Vague plans create paralysis. Specific checklists create momentum."
        },
        "mission": [
            {
                "task": "List all tools and platforms you'll need (be specific)",
                "time": "10 min"
            },
            {
                "task": "List all content you need to create (sales page, product, etc.)",
                "time": "10 min"
            },
            {
                "task": "List all accounts you need to set up",
                "time": "5 min"
            },
            {
                "task": "Prioritize: what must happen before you can accept payment?",
                "time": "10 min"
            }
        ],
        "commonMistakes": "Don't overcomplicate. The minimum viable version needs fewer things than you think. Ask: 'Can I launch without this?' If yes, defer it.",
        "doneMeans": "You have a prioritized checklist of exactly what you need to launch."
    },
    {
        "day": 12,
        "title": "Decide How to Price Your Offer",
        "week": 3,
        "goal": "Set your initial price with clear reasoning",
        "timeEstimate": "30-40 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "Pricing is psychology as much as math. Today you'll decide what to charge, grounded in research and strategy rather than guesswork.\n\nConsider three anchors: cost-based (what does it cost you to deliver?), competition-based (what do alternatives cost?), and value-based (what's it worth to the customer?).\n\nFor side hustles, I recommend starting slightly lower than you're comfortable with, then raising prices as you gain evidence of value. Your first customers are learning opportunities as much as revenue.\n\nRemember: you can always change your price. This isn't permanent—it's a starting point."
        },
        "mission": [
            {
                "task": "Calculate your costs to deliver (time, materials, tools)",
                "time": "10 min"
            },
            {
                "task": "Document competitor pricing from your Day 7 research",
                "time": "5 min"
            },
            {
                "task": "Estimate the value to your customer (what problem is worth solving?)",
                "time": "10 min"
            },
            {
                "task": "Set your initial price and write the reasoning",
                "time": "10 min"
            }
        ],
        "commonMistakes": "Don't race to the bottom on price. Cheap signals low value. Also don't price based on your insecurity—price based on the value delivered.",
        "doneMeans": "You have a specific price with written reasoning based on costs, competition, and value."
    },
    {
        "day": 13,
        "title": "Create a Side Hustle Shopping List",
        "week": 3,
        "goal": "Purchase or sign up for everything on your Day 11 list",
        "timeEstimate": "30-45 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "Planning is easy. Spending money makes things real. Today you'll actually acquire the tools, domains, accounts, and resources you need.\n\nThis is an execution day. Take your prioritized list from Day 11 and start checking items off. Set up accounts. Buy the domain. Subscribe to the tools.\n\nKeep costs minimal at first. Free trials are your friend. You can upgrade when you have revenue. The goal is to have everything in place, not to have everything perfect."
        },
        "mission": [
            {
                "task": "Review your Day 11 checklist of required items",
                "time": "5 min"
            },
            {
                "task": "Sign up for all necessary accounts and tools",
                "time": "20 min"
            },
            {
                "task": "Purchase any essential items (domain, templates, materials)",
                "time": "15 min"
            },
            {
                "task": "Document all login credentials and costs",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Don't buy premium tools before you've validated the idea. Start with free or cheap options. Upgrade when you have customers.",
        "doneMeans": "Every essential tool and account is set up and ready to use."
    },
    {
        "day": 14,
        "title": "Set Up a Way to Get Paid",
        "week": 3,
        "goal": "Configure your payment processing system",
        "timeEstimate": "25-35 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "You can't earn money if people can't pay you. Today you'll set up the infrastructure to accept payments, making your side hustle legitimately operational.\n\nFor most side hustles, this means a payment processor (Stripe, PayPal, Gumroad, etc.) and potentially a simple checkout page. Don't overcomplicate it.\n\nThe key is removing friction. The fewer clicks between 'I want this' and 'I bought this,' the better. Test the flow yourself before asking customers to use it."
        },
        "mission": [
            {
                "task": "Choose a payment platform (Stripe, PayPal, Gumroad, etc.)",
                "time": "10 min"
            },
            {
                "task": "Set up your account and connect bank/payout info",
                "time": "15 min"
            },
            {
                "task": "Create your first product/price in the system",
                "time": "5 min"
            },
            {
                "task": "Test the checkout flow yourself (use test mode if available)",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Don't skip the test transaction. Problems with payment flow kill sales. Also, understand the fees—they affect your real profit.",
        "doneMeans": "You have a working payment system that can accept money for your offer."
    },
    {
        "day": 15,
        "title": "Design Your First Workflow",
        "week": 3,
        "goal": "Document exactly how you'll deliver after someone buys",
        "timeEstimate": "25-35 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "What happens after someone clicks 'buy'? If you don't know, you're not ready to sell. Today you'll map the complete customer experience from purchase to delivery.\n\nThis workflow becomes your operating system. Step 1, step 2, step 3—clear enough that you could follow it at 6 AM after bad sleep.\n\nFor products, this might be automated. For services, it might involve scheduling, communication, and delivery. Either way, document it now so you're not scrambling later."
        },
        "mission": [
            {
                "task": "Map every step after purchase: confirmation, delivery, follow-up",
                "time": "15 min"
            },
            {
                "task": "Identify which steps can be automated and which require your time",
                "time": "5 min"
            },
            {
                "task": "Draft any templates you'll need (emails, messages, documents)",
                "time": "10 min"
            },
            {
                "task": "Set up basic automation if applicable (email sequences, etc.)",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Don't assume you'll figure it out later. The first customer experience shapes whether they recommend you or complain about you.",
        "doneMeans": "You have a documented, step-by-step workflow for what happens after someone purchases."
    },
    {
        "day": 16,
        "title": "Spend 10 Percent More Time on the Most Important",
        "week": 4,
        "goal": "Identify and focus on your highest-leverage activities",
        "timeEstimate": "20-30 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "You've done a lot of preparation. Before launch, let's make sure you're focused on what actually matters.\n\nNot all activities are equal. Some things feel productive but don't move you toward revenue. Others feel simple but create disproportionate results. Today you identify the difference.\n\nLook at everything on your plate. What directly leads to someone paying you? That's where your time should go. Everything else is secondary.\n\n10% more time on the right things beats 50% more time on the wrong things."
        },
        "mission": [
            {
                "task": "List all tasks remaining before launch",
                "time": "5 min"
            },
            {
                "task": "Categorize: which directly lead to revenue vs. nice-to-have?",
                "time": "10 min"
            },
            {
                "task": "Defer or delete anything that's not essential for first sale",
                "time": "5 min"
            },
            {
                "task": "Block time for the highest-leverage remaining tasks",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Don't confuse busy with productive. Logo design, website polish, and social media setup are seductive but rarely essential for the first sale.",
        "doneMeans": "You've ruthlessly prioritized your remaining tasks and deferred the non-essential."
    },
    {
        "day": 17,
        "title": "Publish Your Offer!",
        "week": 4,
        "goal": "Make your offer available for purchase somewhere public",
        "timeEstimate": "35-45 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "This is the day. Whatever you've built—simple or complex—it's time to make it available to the world. The gap between 'working on it' and 'it's live' is one click.\n\nPublishing doesn't mean perfect. It means available. Someone, somewhere, can now see your offer and decide whether to buy.\n\nThis might be a simple landing page, a product listing on a marketplace, or even a direct message to your first prospect. The format matters less than the action.\n\nHit publish. You can improve it later."
        },
        "mission": [
            {
                "task": "Finalize your sales page/listing with offer details and price",
                "time": "15 min"
            },
            {
                "task": "Test the complete flow: view offer, click buy, complete payment",
                "time": "10 min"
            },
            {
                "task": "Publish it—make it accessible via a live URL or marketplace",
                "time": "5 min"
            },
            {
                "task": "Share the link somewhere (one post, one message, one email)",
                "time": "10 min"
            }
        ],
        "commonMistakes": "Don't delay for perfection. A live imperfect offer beats a perfect offer that no one can see. You can iterate after you publish.",
        "doneMeans": "Your offer has a live, public URL and you've shared it with at least one person or channel."
    },
    {
        "day": 18,
        "title": "Sell Like a Girl Scout",
        "week": 4,
        "goal": "Directly ask potential customers to buy",
        "timeEstimate": "30-40 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "Girl Scouts don't wait for customers to find their cookie table. They knock on doors, set up in high-traffic areas, and ask directly. Today, you do the same.\n\nDirect outreach isn't spam—it's service. If your offer genuinely helps people, telling them about it is a favor, not an imposition.\n\nThe key is targeting. Don't blast everyone; reach out to people who actually fit your ideal customer profile. Personalize. Explain why you thought of them. Make it easy to say yes or no."
        },
        "mission": [
            {
                "task": "Identify 10 specific people who match your ideal customer profile",
                "time": "10 min"
            },
            {
                "task": "Write a personalized outreach message (not a template)",
                "time": "10 min"
            },
            {
                "task": "Send your offer to all 10 people via appropriate channels",
                "time": "15 min"
            },
            {
                "task": "Track responses: who replied, what did they say?",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Don't apologize for selling. 'Sorry to bother you' signals that you don't believe in your offer. Be direct and confident.",
        "doneMeans": "You've personally reached out to 10 potential customers with your offer."
    },
    {
        "day": 19,
        "title": "Ask Ten People for Help",
        "week": 4,
        "goal": "Leverage your network for introductions and feedback",
        "timeEstimate": "25-35 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "Beyond direct sales, your network can amplify your reach. Today you ask for help—not sales, but introductions, shares, and feedback.\n\nPeople want to help, but they need to be asked specifically. 'Can you share this?' is better than hoping they notice. 'Do you know anyone who…?' is better than waiting for referrals.\n\nThe ask should be easy to fulfill. Don't ask people to write a novel—ask them to forward an email, share a link, or make an introduction."
        },
        "mission": [
            {
                "task": "Identify 10 people in your network who might help (not buy)",
                "time": "10 min"
            },
            {
                "task": "Write a simple ask: share, introduce, or give feedback",
                "time": "10 min"
            },
            {
                "task": "Send your ask to all 10 people",
                "time": "10 min"
            },
            {
                "task": "Note: who said yes? What did they offer?",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Don't be vague. 'Let me know if you can help' gets ignored. 'Would you share this with your newsletter?' gets action.",
        "doneMeans": "You've asked 10 people for specific help and documented their responses."
    },
    {
        "day": 20,
        "title": "Test, Test, and Test Again",
        "week": 4,
        "goal": "Gather feedback and iterate on your offer",
        "timeEstimate": "30-40 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "By now you've put your offer in front of people. Some may have bought; many probably haven't. Today is about understanding why.\n\nFeedback is data. Why did people say no? What questions did they ask? What confused them? Each response is a clue for improving your offer.\n\nDon't get defensive about feedback. Your first version was a hypothesis. Real market response tells you whether that hypothesis was right."
        },
        "mission": [
            {
                "task": "Review all responses from Days 17-19: what patterns emerge?",
                "time": "15 min"
            },
            {
                "task": "Identify the most common objections or questions",
                "time": "10 min"
            },
            {
                "task": "Make at least one improvement to your offer or messaging",
                "time": "10 min"
            },
            {
                "task": "Follow up with anyone who said 'maybe' or asked questions",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Don't take rejection personally. Every 'no' is information about how to get to 'yes.' Stay curious, not wounded.",
        "doneMeans": "You've documented feedback patterns and made at least one concrete improvement."
    },
    {
        "day": 21,
        "title": "Burn Down the Furniture Store",
        "week": 4,
        "goal": "Create urgency with a legitimate limited-time offer",
        "timeEstimate": "25-35 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "Sometimes people need a reason to act now instead of 'later' (which usually means 'never'). Today you create legitimate urgency around your offer.\n\nThis isn't about fake scarcity or manipulation. It's about giving people a real reason to decide: a limited-time discount, a bonus that expires, a cohort that's filling up.\n\nUrgency works because it forces a decision. Without a deadline, 'maybe' stretches indefinitely. With a deadline, people must choose."
        },
        "mission": [
            {
                "task": "Design a time-limited offer (discount, bonus, or limited availability)",
                "time": "10 min"
            },
            {
                "task": "Set a specific deadline (real, not fake)",
                "time": "5 min"
            },
            {
                "task": "Communicate the offer to your audience (new post, email, update)",
                "time": "15 min"
            },
            {
                "task": "Prepare to follow up before the deadline expires",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Don't create fake urgency that you'll extend later. People remember and trust erodes. If the deadline passes, honor it.",
        "doneMeans": "You have a published time-limited offer with a real deadline."
    },
    {
        "day": 22,
        "title": "Frame Your First Dollar",
        "week": 4,
        "goal": "Celebrate and document your first sale",
        "timeEstimate": "20-30 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "Whether you've made a sale already or you're still working toward it, today is about the milestone of the first dollar.\n\nIf you've made a sale: celebrate it. Document exactly what happened—the channel, the person, the moment. This is the proof that your side hustle works.\n\nIf you haven't yet: analyze why and plan your next actions. The first sale often takes longer than expected. That's normal. Keep going.\n\nThe first dollar matters more than the amount. It's proof of concept."
        },
        "mission": [
            {
                "task": "Document any sales so far: amount, channel, customer details",
                "time": "10 min"
            },
            {
                "task": "If no sale yet: list the three most likely paths to first sale",
                "time": "10 min"
            },
            {
                "task": "Identify what made the sale happen (or what's blocking it)",
                "time": "5 min"
            },
            {
                "task": "Write a 'first dollar story' you could share",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Don't discount the first sale because it was 'just a friend' or 'only $20.' Revenue is revenue. Start celebrating small wins.",
        "doneMeans": "You've documented your first sale (or a concrete plan to get it) and reflected on what worked."
    },
    {
        "day": 23,
        "title": "Track Your Progress and Decide on Next Steps",
        "week": 4,
        "goal": "Review your metrics and plan for the coming weeks",
        "timeEstimate": "25-35 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "Data beats intuition. Today you step back and look at the numbers: views, clicks, responses, sales. What story do they tell?\n\nWithout tracking, you're guessing. With tracking, you're learning. Even if the numbers are small, the patterns reveal what's working and what's not.\n\nBased on this data, you'll make informed decisions about where to focus your energy in the coming weeks."
        },
        "mission": [
            {
                "task": "Gather all metrics: page views, click rates, responses, sales",
                "time": "10 min"
            },
            {
                "task": "Calculate conversion rates at each stage of your funnel",
                "time": "10 min"
            },
            {
                "task": "Identify the biggest bottleneck (where are people dropping off?)",
                "time": "5 min"
            },
            {
                "task": "List three specific actions to improve the bottleneck",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Don't panic over small sample sizes. A 0% conversion rate from 5 visitors means nothing statistically. Focus on getting more data first.",
        "doneMeans": "You have a documented metrics dashboard and a list of specific improvements to make."
    },
    {
        "day": 24,
        "title": "Grow What Works, Let Go of What Doesn't",
        "week": 4,
        "goal": "Double down on successes and abandon failures",
        "timeEstimate": "25-35 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "Not everything you tried worked. That's expected. Today you make hard decisions about what to continue, what to amplify, and what to kill.\n\nEffective strategy is as much about stopping as starting. Every minute spent on something that isn't working is a minute not spent on something that could.\n\nLook at your data from Day 23. What channel brought the most interest? What message resonated? What fell flat? Invest more in winners, cut the losers."
        },
        "mission": [
            {
                "task": "Identify your top-performing channel, message, and tactic",
                "time": "10 min"
            },
            {
                "task": "Identify what clearly isn't working (cut it)",
                "time": "10 min"
            },
            {
                "task": "Plan how to 2x your effort on what's working",
                "time": "10 min"
            },
            {
                "task": "Update your strategy document with these decisions",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Don't keep investing in tactics just because you spent time on them. Sunk cost is irrelevant. Only future potential matters.",
        "doneMeans": "You've made concrete decisions about what to invest in and what to stop."
    },
    {
        "day": 25,
        "title": "Look for Money Lying Under a Rock",
        "week": 4,
        "goal": "Find overlooked revenue opportunities in your existing setup",
        "timeEstimate": "25-35 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "Sometimes the best opportunities are hiding in plain sight. Today you look for money you're leaving on the table—upsells, add-ons, referral opportunities, or underpriced services.\n\nAsk: who's already interested but hasn't bought? What else could current customers need? Where is demand showing up that you haven't addressed?\n\nThese 'rocks' often represent easier revenue than acquiring entirely new customers. The hardest sale is the first one; subsequent sales to satisfied customers are much easier."
        },
        "mission": [
            {
                "task": "List everyone who showed interest but didn't buy",
                "time": "10 min"
            },
            {
                "task": "Identify potential upsells or add-ons for current customers",
                "time": "10 min"
            },
            {
                "task": "Look for referral opportunities from happy customers",
                "time": "5 min"
            },
            {
                "task": "Choose one 'rock' to pursue this week",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Don't only chase new customers while ignoring warm leads. The people who already said 'maybe' are often closest to saying 'yes.'",
        "doneMeans": "You've identified hidden revenue opportunities and picked one to pursue."
    },
    {
        "day": 26,
        "title": "Get It Out of Your Head",
        "week": 4,
        "goal": "Document your systems so the side hustle can run without you",
        "timeEstimate": "30-40 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "Right now, your side hustle lives in your head. That's a risk. If you get busy with life, sick, or just need a break, everything stops.\n\nToday you document. Write down your workflows, your systems, your checklists. Create simple documentation that your future self (or someone else) could follow.\n\nThis isn't about building a corporation. It's about creating clarity and resilience. A documented system is easier to improve, easier to delegate, and easier to resume after a break."
        },
        "mission": [
            {
                "task": "Document your customer acquisition workflow (how do people find you?)",
                "time": "10 min"
            },
            {
                "task": "Document your sales process (how do people buy?)",
                "time": "10 min"
            },
            {
                "task": "Document your delivery process (how do you fulfill?)",
                "time": "10 min"
            },
            {
                "task": "Create a one-page 'operations summary'",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Don't over-document. You're not writing a corporate manual. Simple bullet points are fine. Clarity beats comprehensiveness.",
        "doneMeans": "Your core processes are documented and you could hand them to someone else."
    },
    {
        "day": 27,
        "title": "Back to the Future",
        "week": 4,
        "goal": "Set your vision and plan for the next 90 days",
        "timeEstimate": "30-40 min",
        "lesson": {
            "title": "Why Today Matters",
            "content": "Congratulations—you've completed the 27-day program. You've moved from idea to offer to (hopefully) first sales. That's not nothing. That's real progress.\n\nBut a side hustle isn't a project; it's an ongoing practice. Today you zoom out and plan what happens next.\n\nWhat did you learn? What would you do differently? What are your goals for the next 90 days? The work continues, but now you have momentum, experience, and data to guide you."
        },
        "mission": [
            {
                "task": "Write a 'retrospective': what worked, what didn't, what surprised you",
                "time": "15 min"
            },
            {
                "task": "Set specific goals for the next 90 days (revenue, customers, product)",
                "time": "10 min"
            },
            {
                "task": "Identify the single biggest lever to pull in the next month",
                "time": "5 min"
            },
            {
                "task": "Schedule recurring time for your side hustle going forward",
                "time": "5 min"
            }
        ],
        "commonMistakes": "Don't stop now because 'the program is over.' The program was the beginning. The side hustle continues.",
        "doneMeans": "You've completed a retrospective, set 90-day goals, and scheduled ongoing time for your side hustle."
    }
]